Revit 2027 API
PointCloudColorSettings.Assign Method
 Assigns values of the source settings to this object.
Namespace: Autodesk.Revit.DB.PointClouds
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void Assign(
	PointCloudColorSettings other
)
Public Sub Assign (
	other As PointCloudColorSettings
)
public:
void Assign(
	PointCloudColorSettings^ other
)
member Assign :
        other : PointCloudColorSettings -> unit
Parameters
other PointCloudColorSettings
 The source settings.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
PointCloudColorSettings Class
Autodesk.Revit.DB.PointClouds Namespace